[
	{
		"talk": "It's teams all the way down: Design patterns for engineering organizations",
		"description": "While there is no \"one size fits all\" solution for organizational structure, there are patterns for the different stages of startups that can be adapted to your culture and best practices to leverage."
	},
	{
		"talk": "Leading Distributed Teams",
		"description": "Distributed teams can help find the best talent wherever it is and bring opportunities to developers away from the tech centers. However, leading a distributed team presents unique challenges, interpersonal and technical. What makes distributed teams especially challenging? How can we address these challenges to make our distributed organizations more effective? In this talk, Kevin Goldsmith discusses four main challenges: Conway's Law, Amdahl's Law (as applied to organizations), Empathy, and Communication."
	},
	{
		"talk": "How do you keep growing when you are the leader of the organization?",
		"description": "Your organization looks to you to be the expert, and you are often the most senior around. However, reaching senior leadership doesn't mean that we no longer need to grow professionally. On the contrary, we should never stop trying to improve and get better at our jobs. We should always be striving to learn and grow. We now need to take full responsibility for it."
	},
	{
		"talk": "Architecture and Organization",
		"description": "Over 50 years ago Melvin Conway wrote an article identifying a correspondence between the structure of our organizations and the structure of the software we produce. We still talk about Conway's Law today because of the fundamental truth of that observation. This talk goes beyond that article to examine why this happens, and how you can take advantage of it to make better software."
	},
	{
		"talk": "Fail Fast, Fail Smart... Succeed!",
		"description": "Software development has been evolving. When I started in the industry, working at companies like Microsoft, we would bet many person-years of development and many millions of dollars into the development of products that would sometimes be hits and sometimes be total duds. We were building blind. This blindness was partly due to our waterfall processes, but also to how software distribution and marketing worked then. A flop for a smaller company could mean the end of the line. The cost of failure was incredibly high. Over the years, we learned how to take some of that risk out by switching to agile software development and now Lean. Working this way we can learn quicker, and take smaller risks. However, there are other things we can do in how we architect our software or roll it out that can also reduce the technical and product risk and help us fail smarter and learn faster. In this keynote, I speak about my experiences building waterfall products at Microsoft, building agile and lean at Onfido, Adobe, Spotify, and Avvo; and I give real architectural, cultural, and organizational tools you can use to make your projects and company more failure safe."
	},
	{
		"talk": "When, Why and How to Stop Coding as Your Day Job",
		"description": "As you progress in leadership, more and more of your responsibilities have less and less to do with coding. When is it time to make coding your hobby instead of your job? How do you do it?"
	},
	{
		"talk": "The path from Director to CTO: How to follow it, or how to mentor it",
		"description": "Transitioning from a Director role to a CTO position requires a shift in mindset, skill set, and approach. This talk explores the key steps in this journey, including the importance of mentorship, building a strong network, and developing a strategic vision for technology within the organization."
	},
	{
		"talk": "From Friction to Function: Strengthening the Product-Engineering Alliance",
		"description": "In this talk, I explore the common sources of friction between product and engineering teams, and provide practical strategies for fostering collaboration and alignment. I discuss the importance of shared goals, effective communication, and mutual respect in building a strong partnership between these two critical functions. Attendees will leave with actionable insights and tools to help them strengthen the product-engineering alliance within their own organizations."
	}
]